linkers.org
#+OPTIONS: H:3 num:t toc:t \n:nil @:t ::t |:t ^:{} _:{} -:t f:t *:t <:t todo:t
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:org-info.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="solarized-dark.css" />
#+KEYWORDS: C Linux linking
#+HTML_LINK_HOME: https://pimiento.github.io/
#+HTML_LINK_UP: https://pimiento.github.io/
#+TITLE: Линковка в Linux

** Ссылки
   - [[https://www.linuxjournal.com/article/6463][linuxjournal]]

** Линковка
   Линковка это процесс компоновки различных кусков кода и данных вместе, в результате чего получается один исполняемый файл. Линковка может быть выполнена /во время компиляции/, /во время загрузки/ (загрузчиком) и также /во время исполнения/ (исполняемой программой). Раньше (конец 40-х) линковка выполнялась вручную, сейчас мы имеем программы *линковщики* (linkers), которые дают возможность динамической линковки разделяемых библиотек (shared libraries).

** Основы
   Пусть у нас есть два файла с кодом *a.c* и *b.c*. Чтобы скомпилировать эти два файла при помощи GCC, мы вызываем следующий код
   #+BEGIN_SRC shell :exports code
     gcc a.c b.c
   #+END_SRC
   Это вызывает следующую последовательность:
   1. Запустить препроцессор на файле *a.c* и сохранить результат в промежуточный файл *a.i*
     #+BEGIN_SRC shell :exports code
       cpp other-command-line options a.c /tmp/a.i
     #+END_SRC
   2. Запустить компилятор на *a.i* и сгенерировать ассемблерный код в *a.s*
      #+BEGIN_SRC shell :exports code
        cc1 other-command-line options /tmp/a.i -o /tmp/a.s
      #+END_SRC
   3. Запустить ассемблер на *a.s* и сгенерировать объектный файл *a.o*
      #+BEGIN_SRC shell :exports code
        as other-command-line options /tmp/a.s -o /tmp/a.o
      #+END_SRC
   4. Повторить шаги 1-4 для файла *b.c*, получить объектный файл *b.o*
   5. Работа линковщика состоит в том, чтобы получить на вход сгенерированные объектные файлы *a.o* и *b.o* и сгенерировать из них финальный исполняемый файл *a.out*
      #+BEGIN_SRC shell :exports code
        ld other-command-line-options /tmp/a.o /tmp/b.o -o a.out
      #+END_SRC
   После этого мы можем запустить наш бинарный файл *./a.out*. Оболочка командной строки вызовет /функцию загрузчика/, которая скопирует код и данные из исполняемого файла *a.out* в память, затем передаст управление в начало программы. Функция загрузчик называется *execve*, она загружает код и данные исполняемых объектных файлов в память, затем запускает их выполнение, /прыгая/ на первую инструкцию.

** Линковщики и Загрузчики
   Линковщики (linkers) и загрузчики (loaders) выполняют концептуально разные, но в целом похожие задачи:
   + Загрузка программ. Копирование образа программы с жёсткого диска в RAM. В некоторых случаях загрузка программы (loading) также может включать выделение дисковой памяти или отображение виртульного адресного пространства на дисковое пространство.
   + Релокация (relocation). Компиляторы и ассемблеры генерируют объектный код для каждого входного модуля программы с началом адресации в нуле. Релокация — это процесс изменения адреса загрузки различных частей программы во время объединения всех секций одного типа в одну секцию. Секции кода и данных таким образом будут указывать на корректные адреса в рантайме.
   + Symbol Resolution. Программы имеют внутри себя множество подпрограмм; указание одной подпрограммы на другую подпрограмму происходит через символьные таблицы. Работа линковщика — подменять указания на символ подпрограммы на указание адреса расположения подпрограммы, изменяя объектный код.
   В итоге, получается что *загрузчик* выполняет загрузку программ; *линковщик* выполняет /symbol resolution/; *оба* выполняют релокацию.

** Объектные файлы
   + Перемещаемый объектный файл (relocatable object file) — содержит бинарный код и данные в форме, которая может быть скомпонована с другими перемещаемыми объектными файлами во время компиляции. В итоге получаем исполняемый объектный файл, скомпонованный из перемещаемых объектный файлов.
   + Исполняемый объектный файл (executable object file) — содержат бинарный код и данные в форме, которая может быть напрямую загружена в память и выполнена.
   + Разделяемый объектный файл (shared object file) — специальный тип перемещаемого объектного файла, который может быть загружен в память и слинкован динамически либо во время загрузки в память, либо во время выполнения.
   Компиляторы и ассемблеры генерируют /перемещаемые объектные файлы/ (а так же /разделяемые объектные файлы/). Линковщики компонуют эти объектные файлы вместе и генерируют /исполняемые объектные файлы/.

** ELF
   Объектные файлы разнятся в разных ОС. Первые UNIX системы использовали формат *a.out*. Ранние System V использовали формат *COFF* (common object file format). Windows NT использует разновидность формата *COFF*, называемую *PE* (portable executable); IBM использует собственный формат *IBM 360*. Современные UNIX системы, такие как Linux и Solaris используют формат *UNIX ELF* (executable and linking format).

*** Заголовки Elf
    - .text :: the machine code of the compiled program.
    - .rodata :: read-only data, such as the format strings in printf statements.
    - .data :: initialized global variables
    - .bss :: uninitialized global variables. BSS (начало блока данных — block storage start), эта секция обычно пустует в объектных файлах; этакая заглушка.
    - .symtab :: таблица символов, содержащая информацию о функциях и глобальных переменных, определённых и адресованных в коде программы. Эта таблица не содержит записей о локальных переменных, эта информация содержится на стеке.
    - .rel.text :: список мест в секции *.text*, которые необходимо модифицировать, когда линковщик будет компоновать этот объект с другими объектными файлами.
    - .rel.data :: информация о релокации глобальных переменных, которые объявлены, но не определены в текущем модуле программы.
    - .debug :: таблица отладочных символов с записями о локальных и глобальных переменных. Эта секция будет присутствовать только если компилятору был передан флаг компиляции с таблицей отладочных символов (-g для gcc).
    - .line :: отображение номеров строк в исходном C-файле и машинными кодами инструкций. Эта информация необходима для отладки программ.
    - .strtab :: таблица строк для /таблицы символов/ *.symtab* и /секции/ *.debug*

