linkers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-25 Wed 23:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Линковка в Linux</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="C Linux linking" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Линковка в Linux</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6ca4bf7">1. Ссылки</a></li>
<li><a href="#org9a6006d">2. Линковка</a></li>
<li><a href="#org76f9b09">3. Основы</a></li>
<li><a href="#org32b0043">4. Линковщики и Загрузчики</a></li>
<li><a href="#org58e865f">5. Объектные файлы</a></li>
<li><a href="#org0b69cbb">6. ELF</a>
<ul>
<li><a href="#org06e9730">6.1. Заголовки Elf</a></li>
</ul>
</li>
<li><a href="#org20207dc">7. Символы и адресация символов</a></li>
<li><a href="#org4e7b3ab">8. Линковка статических библиотек</a></li>
<li><a href="#org0f82430">9. Релокация</a></li>
<li><a href="#orgff88a13">10. Динамическая линковка: разделяемые библиотеки</a></li>
<li><a href="#org29e2090">11. Загрузка разделяемой библиотеки из приложения</a></li>
<li><a href="#org93c66c1">12. Утилиты для работы с объектными файлами</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6ca4bf7" class="outline-2">
<h2 id="org6ca4bf7"><span class="section-number-2">1</span> Ссылки</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://www.linuxjournal.com/article/6463">linuxjournal</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9a6006d" class="outline-2">
<h2 id="org9a6006d"><span class="section-number-2">2</span> Линковка</h2>
<div class="outline-text-2" id="text-2">
<p>
Линковка это процесс компоновки различных кусков кода и данных вместе, в результате чего получается один исполняемый файл. Линковка может быть выполнена <i>во время компиляции</i>, <i>во время загрузки</i> (загрузчиком) и также <i>во время исполнения</i> (исполняемой программой). Раньше (конец 40-х) линковка выполнялась вручную, сейчас мы имеем программы <b>линковщики</b> (linkers), которые дают возможность динамической линковки разделяемых библиотек (shared libraries).
</p>
</div>
</div>

<div id="outline-container-org76f9b09" class="outline-2">
<h2 id="org76f9b09"><span class="section-number-2">3</span> Основы</h2>
<div class="outline-text-2" id="text-3">
<p>
Пусть у нас есть два файла с кодом <b>a.c</b> и <b>b.c</b>. Чтобы скомпилировать эти два файла при помощи GCC, мы вызываем следующий код
</p>
<div class="org-src-container">
<pre class="src src-sh">gcc a.c b.c
</pre>
</div>
<p>
Это вызывает следующую последовательность:
</p>
<ol class="org-ol">
<li><p>
Запустить препроцессор на файле <b>a.c</b> и сохранить результат в промежуточный файл <b>a.i</b>
</p>
<div class="org-src-container">
<pre class="src src-sh">cpp other-command-line options a.c /tmp/a.i
</pre>
</div></li>
<li><p>
Запустить компилятор на <b>a.i</b> и сгенерировать ассемблерный код в <b>a.s</b>
</p>
<div class="org-src-container">
<pre class="src src-sh">cc1 other-command-line options /tmp/a.i -o /tmp/a.s
</pre>
</div></li>
<li><p>
Запустить ассемблер на <b>a.s</b> и сгенерировать объектный файл <b>a.o</b>
</p>
<div class="org-src-container">
<pre class="src src-sh">as other-command-line options /tmp/a.s -o /tmp/a.o
</pre>
</div></li>
<li>Повторить шаги 1-4 для файла <b>b.c</b>, получить объектный файл <b>b.o</b></li>
<li><p>
Работа линковщика состоит в том, чтобы получить на вход сгенерированные объектные файлы <b>a.o</b> и <b>b.o</b> и сгенерировать из них финальный исполняемый файл <b>a.out</b>
</p>
<div class="org-src-container">
<pre class="src src-sh">ld other-command-line-options /tmp/a.o /tmp/b.o -o a.out
</pre>
</div></li>
</ol>
<p>
После этого мы можем запустить наш бинарный файл <b>./a.out</b>. Оболочка командной строки вызовет <i>функцию загрузчика</i>, которая скопирует код и данные из исполняемого файла <b>a.out</b> в память, затем передаст управление в начало программы. Функция загрузчик называется <b>execve</b>, она загружает код и данные исполняемых объектных файлов в память, затем запускает их выполнение, <i>прыгая</i> на первую инструкцию.
</p>
</div>
</div>

<div id="outline-container-org32b0043" class="outline-2">
<h2 id="org32b0043"><span class="section-number-2">4</span> Линковщики и Загрузчики</h2>
<div class="outline-text-2" id="text-4">
<p>
Линковщики (linkers) и загрузчики (loaders) выполняют концептуально разные, но в целом похожие задачи:
</p>
<ul class="org-ul">
<li>Загрузка программ. Копирование образа программы с жёсткого диска в RAM. В некоторых случаях загрузка программы (loading) также может включать выделение дисковой памяти или отображение виртульного адресного пространства на дисковое пространство.</li>
<li>Релокация (relocation). Компиляторы и ассемблеры генерируют объектный код для каждого входного модуля программы с началом адресации в нуле. Релокация — это процесс изменения адреса загрузки различных частей программы во время объединения всех секций одного типа в одну секцию. Секции кода и данных таким образом будут указывать на корректные адреса в рантайме.</li>
<li>Symbol Resolution. Программы имеют внутри себя множество подпрограмм; указание одной подпрограммы на другую подпрограмму происходит через символьные таблицы. Работа линковщика — подменять указания на символ подпрограммы на указание адреса расположения подпрограммы, изменяя объектный код.</li>
</ul>
<p>
В итоге, получается что <b>загрузчик</b> выполняет загрузку программ; <b>линковщик</b> выполняет <i>symbol resolution</i>; <b>оба</b> выполняют релокацию.
</p>
</div>
</div>

<div id="outline-container-org58e865f" class="outline-2">
<h2 id="org58e865f"><span class="section-number-2">5</span> Объектные файлы</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Перемещаемый объектный файл (relocatable object file) — содержит бинарный код и данные в форме, которая может быть скомпонована с другими перемещаемыми объектными файлами во время компиляции. В итоге получаем исполняемый объектный файл, скомпонованный из перемещаемых объектный файлов.</li>
<li>Исполняемый объектный файл (executable object file) — содержат бинарный код и данные в форме, которая может быть напрямую загружена в память и выполнена.</li>
<li>Разделяемый объектный файл (shared object file) — специальный тип перемещаемого объектного файла, который может быть загружен в память и слинкован динамически либо во время загрузки в память, либо во время выполнения.</li>
</ul>
<p>
Компиляторы и ассемблеры генерируют <i>перемещаемые объектные файлы</i> (а так же <i>разделяемые объектные файлы</i>). Линковщики компонуют эти объектные файлы вместе и генерируют <i>исполняемые объектные файлы</i>.
</p>
</div>
</div>

<div id="outline-container-org0b69cbb" class="outline-2">
<h2 id="org0b69cbb"><span class="section-number-2">6</span> ELF</h2>
<div class="outline-text-2" id="text-6">
<p>
Объектные файлы разнятся в разных ОС. Первые UNIX системы использовали формат <b>a.out</b>. Ранние System V использовали формат <b>COFF</b> (common object file format). Windows NT использует разновидность формата <b>COFF</b>, называемую <b>PE</b> (portable executable); IBM использует собственный формат <b>IBM 360</b>. Современные UNIX системы, такие как Linux и Solaris используют формат <b>UNIX ELF</b> (executable and linking format).
</p>
</div>

<div id="outline-container-org06e9730" class="outline-3">
<h3 id="org06e9730"><span class="section-number-3">6.1</span> Заголовки Elf</h3>
<div class="outline-text-3" id="text-6-1">
<dl class="org-dl">
<dt>.text</dt><dd>the machine code of the compiled program.</dd>
<dt>.rodata</dt><dd>read-only data, such as the format strings in printf statements.</dd>
<dt>.data</dt><dd>initialized global variables</dd>
<dt>.bss</dt><dd>uninitialized global variables. BSS (начало блока данных — block storage start), эта секция обычно пустует в объектных файлах; этакая заглушка.</dd>
<dt>.symtab</dt><dd>таблица символов, содержащая информацию о функциях и глобальных переменных, определённых и адресованных в коде программы. Эта таблица не содержит записей о локальных переменных, эта информация содержится на стеке.</dd>
<dt>.rel.text</dt><dd>список мест в секции <b>.text</b>, которые необходимо модифицировать, когда линковщик будет компоновать этот объект с другими объектными файлами.</dd>
<dt>.rel.data</dt><dd>информация о релокации глобальных переменных, которые объявлены, но не определены в текущем модуле программы.</dd>
<dt>.debug</dt><dd>таблица отладочных символов с записями о локальных и глобальных переменных. Эта секция будет присутствовать только если компилятору был передан флаг компиляции с таблицей отладочных символов (-g для gcc).</dd>
<dt>.line</dt><dd>отображение номеров строк в исходном C-файле и машинными кодами инструкций. Эта информация необходима для отладки программ.</dd>
<dt>.strtab</dt><dd>таблица строк для <i>таблицы символов</i> <b>.symtab</b> и <i>секции</i> <b>.debug</b></dd>
</dl>
</div>
</div>
</div>
