linkers.org
** Символы и адресация символов
   Каждый /перемещаемый объектный файл/ содержит таблицу символов связанные символы. В контексте линковщика представлены следующие виды символов:
   - /Глобальные символы объявленые на уровне модуля/ — могут быть адресованы из других модулей.Все не-статические и глобальные переменные попадают в эту категорию.
   - /Глобальные символы адресованные в коде, но объевленные где-то вне/. Все функции и переменные с модификатором *extern* попадают в эту категорию.
   - /Локальные символы объявленные и адресованные исключительно во входном модуле/. Все статические функции и статические переменные попадают в эту категорию.
   Линковщик /разрещает/ адресацию символов путём соотношения каждой ссылки на символ только к одному определению символу из таблицы символов.

** Линковка статических библиотек
   Статические библиотеки это коллекция конкатенированных объектных файлов схожего типа. Эти библиотеки хранятся на диске в архиве. Архив также содержит мета-информацию для ускорения поиска в нём. Каждый архив с /ELF/ начинается с магической последовательности /!<arch>\n/.
   Статические библиотеки передаются на вход линковщику, который копирует только объектные модули, упоминаемые в программе. В процессе /разрешения адресации символов/ при работе со статическими библиотеками линковщик сканирует перемещаемые объектные файлы и архивы справа-налево в порядке указания аргументов вызова. В процессе сканирования линковщик создаёт набор O-файлов (перемащаемых объектных файлов, которые будут включены в исполняемый файл); набор U-файлов (неразрешённых пока символов); набор D-файлов (символы, объявленные в предыдущих модулях). Изначально все три набора пустые.
   + На каждый следующий входной аргумент линковщик определяет передаётся ли объектный файл или архив. Если это перемещаемый объектный файл, то линковщик добавляет его в набор O, обновляет наборы U и D и переходит к следующему входному аргументу
   + Если входной аргумент архив, линковщик сканирует список членов модулей, входящих в архив, чтобы отыскать любые неразрешённые символы, находящиеся в наборе U. Если такие символы находятся, то они добавляются в список O и обновляется список U. Список D дополняется символами, найденными в архиве.
   + Когда все входные аргументы пройдены, но если набор U не пуст, то линковщик сообщает об ошибке линковки и завершает свою работу. Иначе, если набор U пуст, линковщик компонует и релоцирует объектные файлы из набора O и генерирует финальный исполняемый файл.

** Релокация
   После того как линковщик разрешил адресацию всех символов, каждый адресация символа ссылается ровно на одно определение символа. В этот момент линковщик запускает процесс релокации, состоящий из двух шагов:
   1. /Релокация секций и определения символов/. Линковщик объединяет все секции одного типа в новую секцию. К примеру, линковщик объединяет все секции *.data* всех входных перемещаемых объектов в новую секцию *.data* результирующего исполняемого файла. Похожий процесс происходит для секции *.code*. Затем линковщик указывает текущий адрес памяти для этой сгенерированной секции. Так для каждой секции и символа. После завершения этого шага каждая инструкция и глобальная переменная в прогармме будет иметь уникальный адрес в момент загрузки.
   2. Релокация адресации символов внутри секций. На этом шаге линковщик изменяет адресации на символы в коде и секциях данных так, чтобы они указывали на корректный уникальный адрес в момент загрузки.
   Ассемблер при релокации создаёт секции *.relo.text* и *.relo.data*, в которых содержится информация как разрешить адресацию (адрес для обращения к символу). ELF содержит в секциях релокации следующие данные:
   + Смещение (offset). Для перемещаемых файлов значение смещения это смещение в байтах от начала секции до получившегося после релокации адреса.
   + Символ (symbol). Индекс символа в символьной таблице.
   + Тип (type). Тип релокации.

** Динамическая линковка: разделяемые библиотеки
   Статические библиотеки, описанные выше, имеют существенный недостаток. Например, возьмём стандартные функции /printf/ и /scanf/. Они используются почти что в каждой программе. Пусть на системе запущено 50-100 процессов, каждый процесс содержит свою копию исполняемого кода /printf/ и /scanf/ — это существенный объём затраченной памяти. Разделяемые библиотеки в свою очередь направлены на исправление этого недостатка статических библиотек. Разделяемые библиотеки это объектные модули, которые могут быть загружены в память в момент исполнения программы и после /слинкованы/ с программой. /Разделяемые библиотеки/ (*shared libraries*) называют так же /разделяемые объекты/ (*shared objects*). На большинстве систем UNIX они именуются с суффиксом *.so*; на системах HP-UX — с суфиксом *.sl*; на системах Microsoft они называются DLL.
   Чтобы собрать разделяемый объектный файл, компилятор надо вызывать со специальным флагом
   #+BEGIN_SRC shell :exports code
     gcc -shared -fPIC -o libfoo.so a.o b.o
   #+END_SRC
   Эта команда сообщает компилятору, что надо сгенерировать разделяемую библиотеку /libfoo.so/, собранную из объектный файлов /a.o/ и /b.o/. Флаг *-fPIC* сообщает компилятору, что надо сгенерировать адресо-независимый код (position independent code — PIC).
   Теперь представим что объектный модуль /bar.o/ зависит от /a.o/ и /b.o/. В этом случае мы компилируем его так:
   #+BEGIN_SRC shell :exports code
     gcc bar.o ./libfoo.so
   #+END_SRC
   Эта команда создаёт исполняемый файл /a.out/, который будет линковаться с /libfoo.so/ в момент загрузки. Здесь /a.out/ не содержит в себе объектный модулей /a.o/ и /b.o/, которые были бы включены в него, если бы мы использовали статическую линковку. Исполняемый файл просто содержит некоторую информацию о релокации и таблицу символов, которые позволяют адресоваться к коду и данным в libfoo.so и эта адресация будет разрешена в процессе исполнения (runtime). Таким образом, /a.out/ это не совсем исполняемый файл, который имеет зависимость от /libfoo.so/. Исполняемый файл содержит секцию *.interp*, где содержится имя динамического линковщика (который сам является разделяемым объектом в системах Linux — ld-linux.so). Таким образом, когда исполняемый файл загружается в память, загрузчик передаёт управление динамическому линковщику. Динамический линковщик содержит некоторый код, который отображает пространство адресов динамических библиотек на пространство адресов испольняемой программы.
   1. Происходит релокация кода и данных из /libfoo.so/ в область памяти
   2. Происходит релокация адресации в /a.out/ на символы объявленные в /libfoo.so/.
   В конце работы динамический линковщик передаёт контроль исполняемой программе. С этого момента местоположение разделяемого объекта зафиксировано в памяти.

