linkers.html

<div id="outline-container-org20207dc" class="outline-2">
<h2 id="org20207dc"><span class="section-number-2">7</span> Символы и адресация символов</h2>
<div class="outline-text-2" id="text-7">
<p>
Каждый <i>перемещаемый объектный файл</i> содержит таблицу символов связанные символы. В контексте линковщика представлены следующие виды символов:
</p>
<ul class="org-ul">
<li><i>Глобальные символы объявленые на уровне модуля</i> — могут быть адресованы из других модулей.Все не-статические и глобальные переменные попадают в эту категорию.</li>
<li><i>Глобальные символы адресованные в коде, но объевленные где-то вне</i>. Все функции и переменные с модификатором <b>extern</b> попадают в эту категорию.</li>
<li><i>Локальные символы объявленные и адресованные исключительно во входном модуле</i>. Все статические функции и статические переменные попадают в эту категорию.</li>
</ul>
<p>
Линковщик <i>разрещает</i> адресацию символов путём соотношения каждой ссылки на символ только к одному определению символу из таблицы символов.
</p>
</div>
</div>

<div id="outline-container-org4e7b3ab" class="outline-2">
<h2 id="org4e7b3ab"><span class="section-number-2">8</span> Линковка статических библиотек</h2>
<div class="outline-text-2" id="text-8">
<p>
Статические библиотеки это коллекция конкатенированных объектных файлов схожего типа. Эти библиотеки хранятся на диске в архиве. Архив также содержит мета-информацию для ускорения поиска в нём. Каждый архив с <i>ELF</i> начинается с магической последовательности <i>!&lt;arch&gt;\n</i>.
Статические библиотеки передаются на вход линковщику, который копирует только объектные модули, упоминаемые в программе. В процессе <i>разрешения адресации символов</i> при работе со статическими библиотеками линковщик сканирует перемещаемые объектные файлы и архивы справа-налево в порядке указания аргументов вызова. В процессе сканирования линковщик создаёт набор O-файлов (перемащаемых объектных файлов, которые будут включены в исполняемый файл); набор U-файлов (неразрешённых пока символов); набор D-файлов (символы, объявленные в предыдущих модулях). Изначально все три набора пустые.
</p>
<ul class="org-ul">
<li>На каждый следующий входной аргумент линковщик определяет передаётся ли объектный файл или архив. Если это перемещаемый объектный файл, то линковщик добавляет его в набор O, обновляет наборы U и D и переходит к следующему входному аргументу</li>
<li>Если входной аргумент архив, линковщик сканирует список членов модулей, входящих в архив, чтобы отыскать любые неразрешённые символы, находящиеся в наборе U. Если такие символы находятся, то они добавляются в список O и обновляется список U. Список D дополняется символами, найденными в архиве.</li>
<li>Когда все входные аргументы пройдены, но если набор U не пуст, то линковщик сообщает об ошибке линковки и завершает свою работу. Иначе, если набор U пуст, линковщик компонует и релоцирует объектные файлы из набора O и генерирует финальный исполняемый файл.</li>
</ul>
</div>
</div>

<div id="outline-container-org0f82430" class="outline-2">
<h2 id="org0f82430"><span class="section-number-2">9</span> Релокация</h2>
<div class="outline-text-2" id="text-9">
<p>
После того как линковщик разрешил адресацию всех символов, каждый адресация символа ссылается ровно на одно определение символа. В этот момент линковщик запускает процесс релокации, состоящий из двух шагов:
</p>
<ol class="org-ol">
<li><i>Релокация секций и определения символов</i>. Линковщик объединяет все секции одного типа в новую секцию. К примеру, линковщик объединяет все секции <b>.data</b> всех входных перемещаемых объектов в новую секцию <b>.data</b> результирующего исполняемого файла. Похожий процесс происходит для секции <b>.code</b>. Затем линковщик указывает текущий адрес памяти для этой сгенерированной секции. Так для каждой секции и символа. После завершения этого шага каждая инструкция и глобальная переменная в прогармме будет иметь уникальный адрес в момент загрузки.</li>
<li>Релокация адресации символов внутри секций. На этом шаге линковщик изменяет адресации на символы в коде и секциях данных так, чтобы они указывали на корректный уникальный адрес в момент загрузки.</li>
</ol>
<p>
Ассемблер при релокации создаёт секции <b>.relo.text</b> и <b>.relo.data</b>, в которых содержится информация как разрешить адресацию (адрес для обращения к символу). ELF содержит в секциях релокации следующие данные:
</p>
<ul class="org-ul">
<li>Смещение (offset). Для перемещаемых файлов значение смещения это смещение в байтах от начала секции до получившегося после релокации адреса.</li>
<li>Символ (symbol). Индекс символа в символьной таблице.</li>
<li>Тип (type). Тип релокации.</li>
</ul>
</div>
</div>

<div id="outline-container-orgff88a13" class="outline-2">
<h2 id="orgff88a13"><span class="section-number-2">10</span> Динамическая линковка: разделяемые библиотеки</h2>
<div class="outline-text-2" id="text-10">
<p>
Статические библиотеки, описанные выше, имеют существенный недостаток. Например, возьмём стандартные функции <i>printf</i> и <i>scanf</i>. Они используются почти что в каждой программе. Пусть на системе запущено 50-100 процессов, каждый процесс содержит свою копию исполняемого кода <i>printf</i> и <i>scanf</i> — это существенный объём затраченной памяти. Разделяемые библиотеки в свою очередь направлены на исправление этого недостатка статических библиотек. Разделяемые библиотеки это объектные модули, которые могут быть загружены в память в момент исполнения программы и после <i>слинкованы</i> с программой. <i>Разделяемые библиотеки</i> (<b>shared libraries</b>) называют так же <i>разделяемые объекты</i> (<b>shared objects</b>). На большинстве систем UNIX они именуются с суффиксом <b>.so</b>; на системах HP-UX — с суфиксом <b>.sl</b>; на системах Microsoft они называются DLL.
Чтобы собрать разделяемый объектный файл, компилятор надо вызывать со специальным флагом
</p>
<div class="org-src-container">
<pre class="src src-sh">gcc -shared -fPIC -o libfoo.so a.o b.o
</pre>
</div>
<p>
Эта команда сообщает компилятору, что надо сгенерировать разделяемую библиотеку <i>libfoo.so</i>, собранную из объектный файлов <i>a.o</i> и <i>b.o</i>. Флаг <b>-fPIC</b> сообщает компилятору, что надо сгенерировать адресо-независимый код (position independent code — PIC).
Теперь представим что объектный модуль <i>bar.o</i> зависит от <i>a.o</i> и <i>b.o</i>. В этом случае мы компилируем его так:
</p>
<div class="org-src-container">
<pre class="src src-sh">gcc bar.o ./libfoo.so
</pre>
</div>
<p>
Эта команда создаёт исполняемый файл <i>a.out</i>, который будет линковаться с <i>libfoo.so</i> в момент загрузки. Здесь <i>a.out</i> не содержит в себе объектный модулей <i>a.o</i> и <i>b.o</i>, которые были бы включены в него, если бы мы использовали статическую линковку. Исполняемый файл просто содержит некоторую информацию о релокации и таблицу символов, которые позволяют адресоваться к коду и данным в libfoo.so и эта адресация будет разрешена в процессе исполнения (runtime). Таким образом, <i>a.out</i> это не совсем исполняемый файл, который имеет зависимость от <i>libfoo.so</i>. Исполняемый файл содержит секцию <b>.interp</b>, где содержится имя динамического линковщика (который сам является разделяемым объектом в системах Linux — ld-linux.so). Таким образом, когда исполняемый файл загружается в память, загрузчик передаёт управление динамическому линковщику. Динамический линковщик содержит некоторый код, который отображает пространство адресов динамических библиотек на пространство адресов испольняемой программы.
</p>
<ol class="org-ol">
<li>Происходит релокация кода и данных из <i>libfoo.so</i> в область памяти</li>
<li>Происходит релокация адресации в <i>a.out</i> на символы объявленные в <i>libfoo.so</i>.</li>
</ol>
<p>
В конце работы динамический линковщик передаёт контроль исполняемой программе. С этого момента местоположение разделяемого объекта зафиксировано в памяти.
</p>
</div>
</div>
