linkers.org
** Загрузка разделяемой библиотеки из приложения
   Разделяемая библиотека может быть загружена из приложения в любой момент выполнения. Приложение может обратиться к динамическому линковщику с просьбой загрузить и прилинковать динамическую библиотеку. Linux, Solaris и другие системы поддерживают различниые функции, которые могут быть использованы для динамической загрузки разделяемых объектов. В Linux это системные вызовы /dlopen/, /dlsym/, /dlclose/, используемые для загрузки разделяемого объекта, поиска символа в разделяемом объекте и для закрытия разделяемого объекта.

** Утилиты для работы с объектными файлами
   + ar :: создаёт статические библиотеки.
   + objdump :: может быть использована для показа всей информации о бинарном объектном файле.
   + strings :: показывает все строковые данные в бинарном файле, содержащие печатные символы.
   + nm :: перечислить символы, определённые в символьной таблице объектного файла.
   + ldd :: перечислить динамические библиотеки, от которых зависит объектный файл.
   + strip :: удалить информацию из таблицы символов.
