linkers.html

<div id="outline-container-org29e2090" class="outline-2">
<h2 id="org29e2090"><span class="section-number-2">11</span> Загрузка разделяемой библиотеки из приложения</h2>
<div class="outline-text-2" id="text-11">
<p>
Разделяемая библиотека может быть загружена из приложения в любой момент выполнения. Приложение может обратиться к динамическому линковщику с просьбой загрузить и прилинковать динамическую библиотеку. Linux, Solaris и другие системы поддерживают различниые функции, которые могут быть использованы для динамической загрузки разделяемых объектов. В Linux это системные вызовы <i>dlopen</i>, <i>dlsym</i>, <i>dlclose</i>, используемые для загрузки разделяемого объекта, поиска символа в разделяемом объекте и для закрытия разделяемого объекта.
</p>
</div>
</div>

<div id="outline-container-org93c66c1" class="outline-2">
<h2 id="org93c66c1"><span class="section-number-2">12</span> Утилиты для работы с объектными файлами</h2>
<div class="outline-text-2" id="text-12">
<dl class="org-dl">
<dt>ar</dt><dd>создаёт статические библиотеки.</dd>
<dt>objdump</dt><dd>может быть использована для показа всей информации о бинарном объектном файле.</dd>
<dt>strings</dt><dd>показывает все строковые данные в бинарном файле, содержащие печатные символы.</dd>
<dt>nm</dt><dd>перечислить символы, определённые в символьной таблице объектного файла.</dd>
<dt>ldd</dt><dd>перечислить динамические библиотеки, от которых зависит объектный файл.</dd>
<dt>strip</dt><dd>удалить информацию из таблицы символов.</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-10-25 Wed 23:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
